{
  "Alabama": {
    "Overview": "<p>The Supreme Court of Alabama is the highest court in the state of Alabama. The court consists of a chief justice and eight associate justices. Each justice is elected in partisan elections for staggered six-year terms. The Supreme Court is housed in the Heflin-Torbert Judicial Building in downtown Montgomery, Alabama.</p><p>The Governor of Alabama may fill vacancies when they occur for the remainder of unexpired terms. The current partisan line-up for the court is all Republican. There is no specific limitation on the number of terms to which a member may be elected. However, the state constitution under Amendment 328, adopted in 1973, prohibits any member from seeking election once they have attained the age of seventy years. This amendment would have prohibited then Chief Justice Roy Moore from seeking re-election in 2018. However, on April 26, 2017, Moore announced his intent to run for the United States Senate seat formerly held by United States Attorney General Jeff Sessions, and resigned from the court.</p><p>The Clerk of Court is Julia Jordan Weller.</p>",
    "History": "<p>The Supreme Court of Alabama was organized under the governorship of William Wyatt Bibb, and had its beginnings with the Alabama Constitution of 1819, which stated that until the General Assembly deemed otherwise, the functions of the Supreme Court would be handled by the judges of the Alabama circuit courts. The circuit judges were elected by a joint vote of both houses of the Alabama Legislature. These judges met in May 1820 in the capital city of Cahaba for the first term of the Supreme Court. Clement Comer Clay was appointed by the other judges as the first chief justice of the court. Following his resignation in 1823, he was succeeded by Abner Smith Lipscomb.</p><p>The court was then reorganized in 1832. It then became a separate court with three justices elected to six-year terms. Abner Lipscomb remained as chief justice. In 1851 the number of justices was increased to five. In 1853 the membership of the court was reduced to three again. By this time the court had its own chambers in the newly completed Alabama State Capitol. No changes to the court occurred during the years of the Civil War.</p><p>The new state constitution of 1868, drafted during the Reconstruction Era, committed the election of the three justices to the people rather than the legislature. The number of justices was increased to four in 1889. In 1891, the number increased to five. Following the adoption of the 1901 constitution, the 1903 session of the legislature raised the number of justices to seven. In 1940 the Supreme Court moved from the Capitol Building to 445 Dexter Avenue. The building had been built as a Scottish Rite temple in 1926 but was sold to the state during the financially difficult years of the Great Depression. The state acquired and started a remodel of the building in 1938 for the relocation of the Judicial Department, Attorney General and State Law Library.</p><p>Legislative Act Number 602, 1969 Alabama Acts was passed during Regular Session of 1969. It increased the number of associate justices to eight, bringing the number of court justices to the configuration that remains today. Former Justice Janie L. Shores was the first of six women to serve on the court. She was elected to the court in 1974. The first of three black justices to serve on the court was former Justice Oscar W. Adams Jr., who in 1980 was initially appointed by then Governor Fob James to serve the remainder of an unexpired term. Justice Adams would become the first black justice elected to the court when he was elected two years later to serve a full six-year term. The court moved to the new Heflin-Torbert Judicial Building at 300 Dexter Avenue in 1994.</p>",
    "Composition": "<ul><li>Tom Parker, chief justice (R)</li><li>Jay Mitchell (R)</li><li>Tommy Bryan (R)</li><li>Will Sellers (R)</li><li>Alisa Kelli Wise (R)</li><li>Michael F. Bolin (R)</li><li>Sarah Hicks Stewart (R)</li><li>Brady E. Mendheim Jr. (R)</li><li>Greg Shaw (R)</li></ul>"
  },
  "Alaska": {
    "Overview": "<p>The Alaska Supreme Court is the state supreme court for the U.S. state of Alaska. Its decisions are binding on all other Alaska state courts, and the only court its decisions may be appealed to is the Supreme Court of the United States. The Alaska Supreme Court hears appeals from lower state courts and also administers the state's judicial system.</p><p>The court consists of five justices, one of whom is internally chosen to serve as chief justice for a three-year term. The justices are appointed by the governor of Alaska from slates of candidates approved by the Alaska Judicial Council, an independent commission of Alaskan lawyers and lay citizens. Each justice faces a judicial retention election after their third year of service and once every ten years thereafter.</p><p>It hears cases on a monthly basis in Anchorage, approximately quarterly in Fairbanks and Juneau, and as needed in other Alaska communities. The court prefers to hear oral arguments in the city where the case was heard in the trial court.</p>",
    "History": "<p>Alaska's supreme court was founded along with the rest of Alaska's court system, about six months after statehood. From 1884 until the establishment of Alaska Supreme Court, the United States Territorial District Court for the District of Alaska was the highest judicial body in Alaska.</p><p>The court originally consisted of two associate justices and a chief justice. In 1967, the court was expanded to five justices, and the chief justice was restricted to a three-year term.</p>",
    "Composition": "<ul><li>Daniel Winfree, Chief Justice (R)</li><li>Peter J. Maassen (R)</li><li>Susan M. Carney (I)</li><li>Dario Borghesan (R)</li><li>Jennifer S. Henderson (R)</li></ul>"
  },
  "Arizona": {
    "Overview": "<p>The Arizona Supreme Court is the state supreme court of the U.S. state of Arizona. Sitting in the Supreme Court building in downtown Phoenix, the court consists of a chief justice, a vice chief justice, and five associate justices. Each justice is appointed by the governor of Arizona from a list recommended by a bipartisan commission. Justices stand for retention in an election two years after their appointment and then every six years. They must retire at age 70.</p>",
    "History": "<p>The court started in 1912 with 3 justices. Alfred Franklin, Donald L. Cunningham, and Henry D. Ross took office on February 14, 1912 (Valentine's Day). In 1949, the Court expanded from 3 to 5 justices and from 5 to 7 justices in 2016.</p><p>The jurisdiction of the court is prescribed by Article VI, Section 5 of the Arizona Constitution. Most of the appeals heard by the court go through the Arizona Court of Appeals, except for death penalty cases, over which the Arizona Supreme Court has sole appellate jurisdiction. The court also has original jurisdiction in a few other circumstances as outlined in the Arizona Constitution. A quorum is three, but the whole court must sit in order to declare a law unconstitutional.</p>",
    "Composition": "<ul><li>Robert M. Brutinel, Chief Justice (R)</li><li>Ann Timmer, Vice Chief Justice (R)</li><li>Clint Bolick (R)</li><li>John Lopez IV (R)</li><li>James Beene (R)</li><li>Bill Montgomery (R)</li><li>Kathryn Hackett King (R)</li></ul>"
  }
}
